app/controllers/admins_controller.rb

  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "admin1"], ["created_at", "2017-11-20 06:03:26.693699"], ["updated_at", "2017-11-20 06:03:26.693699"], ["password_digest", "$2a$10$Gzcawf8wbjB/EUeF1X6HsubrwfPknpl/wBp6o178CPyI21BLDcyti"]]