app/controllers/guests_controller.rb

  def create
    @guest = Guest.new(guest_params)

    respond_to do |format|
      if @guest.save
---
INSERT INTO "guests" ("sei", "mei", "sei_kana", "mei_kana", "email", "tel", "sex", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_guest
      @guest = Guest.find(params[:id])
---
SELECT  "guests".* FROM "guests" WHERE "guests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]