app/controllers/login_controller.rb

  def auth
    admin = Admin.find_by(name: params[:name])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."name" = ? LIMIT ?  [["name", "admin1"], ["LIMIT", 1]]