app/controllers/plans_controller.rb

  def create
    @plan = Plan.new(plan_params)

    respond_to do |format|
      if @plan.save
---
INSERT INTO "plans" ("hotel_id", "title", "content", "price", "image", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @plan.update(plan_params)
---
UPDATE "plans" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["title", "Placid大手町限定プラン"], ["content", "Placid大手町限定のお得なプランです。"], ["updated_at", "2017-11-21 07:58:01.275548"], ["id", 1]]