app/controllers/reservations_controller.rb

SELECT COUNT(*) FROM "reservations" WHERE (reserve_date >= '2017-11-20')
SELECT "reservations".* FROM "reservations" WHERE (reserve_date >= '2017-11-21') ORDER BY "reservations"."reserve_date" ASC, "reservations"."id" ASC
---
  def list
    # 宿泊予約件数取得
    require "date"
    today = Date.today
    count = Reservation.where('reserve_date >= ?', today).count
    logger.debug(count)
    if count == 0
      # 取得件数が0の場合
      @error = '宿泊予約はありません。'
    else
      # 一覧取得SQL文作成
      @reservations = Reservation.where('reserve_date >= ?', today).order(reserve_date: :asc, id: :asc)

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "reservations" SET "cancel_flag" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["cancel_flag", "t"], ["updated_at", "2017-11-22 09:14:45.103465"], ["id", 2]]
---
  def cancel
    reservation = Reservation.find(params[:no])
    if reservation.update(cancel_flag: true)

INSERT INTO "reservations" ("hotel_id", "guest_id", "plan_id", "guest_num", "reserve_date", "reserve_date_num", "price", "cancel_flag", "room_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save

UPDATE "reservations" SET "cancel_flag" = ?, "updated_at" = ? WHERE "reservations"."id" = ?  [["cancel_flag", "f"], ["updated_at", "2017-11-22 10:02:07.232800"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @reservation.update(reservation_params)

DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 1]]
---
  def destroy
    @reservation.destroy