app/controllers/rooms_controller.rb

  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("hotel_id", "plan_id", "room_no", "smoke_flag", "bed_type", "room_type", "usable_flag", "maximum_capacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @room.update(room_params)
---
UPDATE "rooms" SET "reservation_id" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["reservation_id", 1], ["updated_at", "2017-11-21 08:42:44.136323"], ["id", 1]]